"""
变量：变量是用来存储数据的标识符，它可以用来引用存储在内存中的值。

命名规则：变量名只能包含字母、数字和下划线，且不能以数字开头。区分大小写（例如myVar和myvar是不同的变量）。

命名禁忌：避免使用Python保留字（如if、else、while等），尽量避免与内置函数名（如print、list等）重名，且命名应尽量具有描述性，避免使用无意义的名字。

"""

"""
//符合Python命名规则的变量名示例：
username：由字母组成。
user_age：包含字母和下划线。
user1：包含字母和数字。
user_2_age：包含字母、数字和下划线。

//不符合规则的示例包括：
1user：不能以数字开头。
user-age：包含了非法字符（-）。
user age：包含了空格。
for：是Python的保留字，不能作为变量名。

"""

"""
''：单引号，表示一个单行字符串。例：'hello'。
""：双引号，也表示一个单行字符串。例："world"。
''' 或 """  #三引号（单引号或双引号），用于表示多行字符串，可以包含换行符。
"""
"""



#变量名字
aa = 1
user = "用户"
name = '名字'
file = '文件名'
img_url = '图片链接'
urls = '链接组'
user1 = '用户1'
user2 = '用户2'
user_2_age = '用户2年龄'


