"""
数据类型：数据类型定义了变量所能存储的数据的类型和操作方式。
数据类型：
    整数（int）：如5、-3。
    浮点数（float）：如3.14、-0.001。
    字符串（str）：如"hello"、'world'。
    布尔值（bool）：True或False。
    列表（list）：如[1, 2, 3]。
    元组（tuple）：如(1, 2, 3)。
    字典（dict）：如{'key': 'value'}。
    集合（set）：如{1, 2, 3}。
区别：
    整数和浮点数：整数是没有小数部分的数字，浮点数有小数部分。
    字符串：用于存储文本，支持各种操作如拼接和切片。
    布尔值：只有两个值，True和False，用于条件判断。
    列表和元组：列表是可变的，元组是不可变的。
    字典：存储键值对，通过键快速查找值。
    集合：存储唯一的元素，支持数学集合操作如并集和交集。

"""
#整数
i = 1, 3, 3, 6, 5, -9, -6, -4, -2
#浮点数
3.1,6.5,3.33,566.88646
#字符串
'name','float'
#布尔型
True,False
#列表
[1,5,6,97,41,25,8]
#元祖
(1,123,1,3,5,6,1)
#字典
{
    'key': 'value'
}
#集合
{1,13,13,5,6,164,56,13,1}
