"""
运算符：运算符是用于执行操作的符号或关键词，如加法、减法等。
运算符类型：
    算术运算符：+（加）、-（减）、*（乘）、/（除）、%（取余）、//（整除）、**（幂）。
    比较运算符：==（等于）、!=（不等于）、>（大于）、<（小于）、>=（大于等于）、<=（小于等于）。
    逻辑运算符：and（与）、or（或）、not（非）。
    赋值运算符：=（赋值）、+=（加等于）、-=（减等于）、*=（乘等于）、/=（除等于）。
    位运算符：&（与）、|（或）、^（异或）、~（取反）、<<（左移）、>>（右移）。
    成员运算符：in（在）、not in（不在）。
    身份运算符：is（是）、is not（不是）。
"""
# 运算符号
a = 1
b = 2
c = 3
# 加法
d = a + b
print(d)
# 减法
f = b - a
print(f)
# 乘法
g = a * b
print(g)
# 除法
h = c / a
print(h)
# 取余数
i = c % b
print(i)
# 整除
j = c // b
print(j)
